##==============================================================================
## ■ GameFighter
##------------------------------------------------------------------------------
## 战斗时战斗单位的对象。
##==============================================================================
class_name GameFighter
##--------------------------------------------------------------------------
## ● 战斗单位的数值，技能等
##--------------------------------------------------------------------------
var enemy_id      : int          ## id
var name          : String       ## 名字
var level         : int          ## 等级 
var maxhp         : int          ## 初始生命值
var hp            : float        ## 生命值（计算进行时）
var atk           : int          ## 攻击
var hit           : int = 1      ## 连击
var vampire       : float        ## 吸血
var def           : int          ## 防御
var def_break_per : float        ## 攻击时无视防御的比例
var mdef          : int          ## 基础护盾
var map_mdef      : int :        ## 地图护盾 自动切装打开时用于展示实际伤害
	get:
		#return mdef
		return MotaSystem.enemyReady.max_mdef
var total_mdef    : int          ## 经过增幅后的护盾
var exp           : int          ## 经验
var gold          : int          ## 金币 
var first         : int          ## 先攻次数
var first_atk     : float        ## 第一次攻击倍数
var player_damage : int          ## 对玩家造成的固伤
var damage_plus   : float = 1    ## 增伤系数
var damage_rate   : float = 1    ## 受伤系数
var value         : Dictionary   ## 技能反馈参数
var self_atk      : float        ## 反伤系数
var skill         : Dictionary   ## 技能
var state         : Dictionary   ## 增益或减益状态
var buf           : Dictionary   ## 从单位中带来的战斗状态
var equip         : Dictionary   ## 装备
var target        : GameFighter  ## 目标
##--------------------------------------------------------------------------
## ● 初始化载入属性，传入id为0则视为角色
##--------------------------------------------------------------------------
func _init(id : int = 0, buff : Dictionary = {}, fighter : GameFighter = null):
	if id != 0:
		var dr = DatatableManager.Enemy.data[id]
		# 导入能力值
		enemy_id = id
		name   = dr.enemyName
		level  = dr.enemyLevel
		maxhp  = dr.enemyMaxHp
		atk    = dr.enemyAtk
		def    = dr.enemyDef
		skill  = dr.enemySkill
		exp    = dr.enemyExp
		gold   = dr.enemyGold
		buf    = buff
		target = fighter
		# 加载状态、技能、装备
		load_buff(buff)
		load_skill()
		load_equip()
	else:
		# 导入能力值
		level       = MotaSystem.gameData.level
		maxhp       = MotaSystem.gameData.hp
		hp          = maxhp
		atk         = MotaSystem.gameData.atk
		def         = MotaSystem.gameData.def
		mdef        = MotaSystem.gameData.mdef
		damage_plus = MotaSystem.gameData.all_damage_rate
		damage_rate = MotaSystem.gameData.all_resistance
		equip       = MotaSystem.gameData.equip.duplicate()
		total_mdef  = mdef
##--------------------------------------------------------------------------
## ● 载入Buff
##--------------------------------------------------------------------------
func load_buff(area : Dictionary = {}):
	state = {"hp%"      : 1.0 ,
			 "atk%"     : 1.0 ,
			 "def%"     : 1.0 ,
			 "mdef%"    : 1.0 ,
			 "damage"   : 1.0 ,
			 "map_plus" : 1.0 ,}  # 统一结算
	##----------------------------------------------------------------------
	## ● 结算所有BUFF
	##----------------------------------------------------------------------
	for buff in area:
		match buff:
			"hp":
				maxhp           += area[buff]
			"atk":
				atk             += area[buff]
			"def":
				def             += area[buff]
			"mdef":
				mdef            += area[buff]
			_:
				if state.has(buff):
					state[buff] += area[buff] * 0.01
	##----------------------------------------------------------------------
	## ● 增强能力值
	##----------------------------------------------------------------------
	maxhp       *= state["hp%"]
	atk         *= state["atk%"]
	def         *= state["def%"]
	mdef        *= state["mdef%"]
	damage_plus *= state["damage"]
	hp           = maxhp
##--------------------------------------------------------------------------
## ● 初始化载入技能
##--------------------------------------------------------------------------
func load_skill():
	var val : PackedFloat64Array
	##----------------------------------------------------------------------
	## :[先攻]: 战斗时，该敌人首先攻击{0}次
	##----------------------------------------------------------------------
	if skill.has("1"):
		first += int(skill["1"])
	##----------------------------------------------------------------------
	## :[魔攻]: 战斗时，该敌人攻击无视角色{0}%的防御
	##----------------------------------------------------------------------
	if skill.has("2"):
		def_break_per = [float(skill["2"]) * 0.01, 1].min()
	##----------------------------------------------------------------------
	## :[连击]: 战斗时，该敌人每回合攻击{0}次
	##----------------------------------------------------------------------
	if skill.has("3"):
		hit = int(skill["3"])
	##----------------------------------------------------------------------
	## :[坚固]: 该敌人的防御会随着角色的攻击增加，且免疫特殊伤害
	##----------------------------------------------------------------------
	if skill.has("4"):
		def = [target.atk - 1, def].max()
	##----------------------------------------------------------------------
	## :[吸血]: 战斗时，该敌人每次攻击造成的伤害{0}%会回复自身生命
	##----------------------------------------------------------------------
	if skill.has("5"):
		vampire += float(skill["5"]) * 0.01
	##----------------------------------------------------------------------
	## :[虚化]: 战斗时，该敌人受到的伤害减少{0}%
	##----------------------------------------------------------------------
	if skill.has("6"):
		damage_rate -= (float(skill["6"]) * 0.01)
	##----------------------------------------------------------------------
	## :[烈火]: 该敌人第一回合攻击时攻击力为{0}倍
	##----------------------------------------------------------------------
	if skill.has("7"):
		first_atk = int(skill["7"])
	##----------------------------------------------------------------------
	## :[净化]: 战斗前，该敌人对角色造成角色护盾{0}倍的伤害
	##----------------------------------------------------------------------
	if skill.has("8"):
		value["8"] = { "damage" : int(skill["8"]) * target.mdef * damage_rate}
		player_damage += value["8"]["damage"]
	##----------------------------------------------------------------------
	## :[破甲]: 战斗前，对角色造成{0}点伤害
	##----------------------------------------------------------------------
	if skill.has("9"):
		player_damage += int(skill["9"])
	##----------------------------------------------------------------------
	## :[反击]: 战斗时，每回合角色攻击时也会对自己也攻击一次，造成{0}%伤害
	##----------------------------------------------------------------------
	if skill.has("10"):
		self_atk += float(skill["10"]) * 0.01
		value["10"] = { "damage" : 0 , "total_damage" : 0 }
	##----------------------------------------------------------------------
	## :[中毒]: 战斗后获得{0}层【中毒】状态，每{1}点护盾会减少一层实际获得的状态
	##----------------------------------------------------------------------
	if skill.has("11"):
		val = skill["11"].split_floats("/")
		value["11"] = { "total_buff" : [val[0] - floori(target.mdef / val[1]), 0].max()}
	##----------------------------------------------------------------------
	## :[衰弱]: 战斗后获得{0}层【衰弱】状态，每{1}点护盾会减少一层实际获得的状态
	##----------------------------------------------------------------------
	if skill.has("12"):
		val = skill["12"].split_floats("/")
		value["12"] = { "total_buff" : [val[0] - floori(target.mdef / val[1]), 0].max()}
	##----------------------------------------------------------------------
	## :[迟缓]: 战斗后获得{0}层【迟缓】状态，每{1}点护盾会减少一层实际获得的状态
	##----------------------------------------------------------------------
	if skill.has("13"):
		val = skill["13"].split_floats("/")
		value["13"] = { "total_buff" : [val[0] - floori(target.mdef / val[1]), 0].max()}
	##----------------------------------------------------------------------
	## :[诅咒]: 战斗后获得{0}层【诅咒】状态，每{1}点护盾会减少一层实际获得的状态
	##----------------------------------------------------------------------
	if skill.has("14"):
		val = skill["14"].split_floats("/")
		value["14"] = { "total_buff" : [val[0] - floori(target.mdef / val[1]), 0].max()}
	##----------------------------------------------------------------------
	## :[协同]: 地图上除自身外每有一只同种该敌人便增加自身{0}%的生命（线性叠加）
	##----------------------------------------------------------------------
	if skill.has("15"):
		value["15"] = { "hp_percent" : (state["hp%"] - 1) * 100}
	##----------------------------------------------------------------------
	## :[仇恨]: 战斗后本地图其他拥有该属性的敌人伤害增加{0}%（非线性叠加）
	##----------------------------------------------------------------------
	if skill.has("16"):
		value["16"] = { "damage_percent" : (damage_plus - 1) * 100}
	##----------------------------------------------------------------------
	## :[军阵]: 该敌人攻防小于角色攻防时会额外增加二者差值{0}%的攻防
	##----------------------------------------------------------------------
	if skill.has("17"):
		var extra_atk = floori(max(target.atk - atk , 0) * float(skill["17"]) * 0.01)
		var extra_def = floori(max(target.def - def , 0) * float(skill["17"]) * 0.01)
		value["17"] = { "extra_atk" : extra_atk , "extra_def" : extra_def }
		atk += extra_atk
		def += extra_def
	##----------------------------------------------------------------------
	## :[阻击]: 角色经过该敌人十字领域时受到{0}点伤害，同时该敌人会后退一格
	##----------------------------------------------------------------------
	if skill.has("25"):
		value["25"] = { "map_damage" : floori(max(int(skill["25"]) - target.map_mdef, 0) * state["map_plus"]) }
	##----------------------------------------------------------------------
	## :[领域]: 角色经过该敌人{0}格范围内时受到{1}点伤害，可被护盾减免
	##----------------------------------------------------------------------
	if skill.has("26"):
		val = skill["26"].split_floats("/")
		value["26"] = { "map_damage" : floori(max(val[1] - target.map_mdef, 0) * state["map_plus"]) }
	##----------------------------------------------------------------------
	## :[域场]: 角色经过该敌人{0}格范围内时受到{1}点伤害，可被护盾减免
	##----------------------------------------------------------------------
	if skill.has("27"):
		value["27"] = { "map_damage_buff" : (state["map_plus"] - 1) * 100.0 }
	##----------------------------------------------------------------------
	## :[共鸣]: 该敌人攻击/防御增加地图上{0}%的攻击/防御
	##----------------------------------------------------------------------
	if skill.has("30"):
		if !buf.is_empty():
			value["30"] = { "extra_atk" : int(MotaSystem.enemyReady.value["atk"] * float(skill["30"]) * 0.01) , "extra_def" : int(MotaSystem.enemyReady.value["def"] * float(skill["30"]) * 0.01) }
		else:
			value["30"] = { "extra_atk" : 0 , "extra_def" : 0 }
	##----------------------------------------------------------------------
	## :[孳生]: 该敌人生命增加地图上{0}%的生命
	##----------------------------------------------------------------------
	if skill.has("31"):
		if !buf.is_empty():
			value["31"] = { "extra_hp" : int(MotaSystem.enemyReady.value["hp"] * float(skill["31"]) * 0.01) }
		else:
			value["31"] = { "extra_hp" : 0 }
	##----------------------------------------------------------------------
	## :[射击]: 角色经过该敌人直线可视范围时受到{0}点伤害，可被护盾减免
	##----------------------------------------------------------------------
	if skill.has("33"):
		value["33"] = { "map_damage" : floori(max(float(skill["33"]) - target.map_mdef, 0) * state["map_plus"]) }

func load_equip():
	# 示例
	## 引用数据来源不要直接用motasystem.gamedata的数据，不然会导致自动切装失效
	## 如果要检索对应的效果，直接使用target来替换motasystem.gamedata即可
	## target中包含了对应装备排序下的具体gamedata数据
	if target.equip.get("equip_1") == "999":
		atk -= 10000
